{
    "mapGuide.greeting.text": "Ahoy there, traveller! Welcome to Clam Island. Here you can buy unique Clams, farm them for Pearls to collect or trade them, or use them to boost your investment in the Bank.",
    "mapGuide.greeting_alt.text": "Hmmm? Oh, you want me to take you on a quick tour of the island? {{lol}}",
    "mapGuide.step2.text": "I see that this is your first time here – would you like me to give you a quick tour?",
    "mapGuide.step3.text": "Ok, feel free to explore by yourself in that case. I recommend that you start with getting some $GEM, the Clam Island currency, from the Bank. If you have any questions, Janet in the Infocenter will be able to help you out.",
    "mapGuide.step4.text": "Alright! Let’s head off then.",
    "mapGuide.step5.text": "First stop, the Visitor’s Infocenter. We’ve only recently opened the island, so Janet the lighthouse keeper hasn’t quite got everything ready yet.",
    "mapGuide.step6.text": "More information is continuously being added to the Infocenter. Eventually, everything you will ever need to know about Clam Island will be found in there!",
    "mapGuide.step7.text": "This is the Clam Island Bank. This is where you can buy the local currency, $GEM, or the governance token, $SHELL.",
    "mapGuide.step8.text": "You can also invest funds into a range of investment pools, and some of them will not require any $GEM or $SHELL. Tanja, our resident banker, will guide you through the process.",
    "mapGuide.step9.text": "However, if you want to be able to buy Clams and farm Pearls, you will need to get some $GEM from the Bank!",
    "mapGuide.step10.text": "Once you get yourself some $GEM, you can come to the Shop to buy Clams. Diego the shopkeeper will look after you here.",
    "mapGuide.step11.text": "Diego only has a limited number of Clams available each week, and the price for buying a Clam can fluctuate depending on market demand.",
    "mapGuide.step12.text": "We have some special Clams here at Clam Island, and the ones you buy will have a completely random set of traits – not even Diego will know the traits before you collect your Clam!",
    "mapGuide.step13.text": "You can also ask Diego to harvest a live Clam bought more than 48 hours ago for $SHELL tokens. This process will destroy your Clam though, so choose wisely!",
    "mapGuide.step14.text": "Clams that you purchase and Pearls that you produce will be sent to the Saferoom. This is where you will be able to see them.",
    "mapGuide.step15.text": "You will also soon be able to inspect any Clam or Pearl on Clam Island from within the comfort of the Saferoom - this feature is currently under construction.",
    "mapGuide.step16.text": "Once you buy some Clams from Diego’s Shop, you will be able to come to the farm and deposit them in order to produce Pearls.",
    "mapGuide.step17.text": "It takes anywhere between 8 to 72 hours for a Pearl to be produced, and no one knows what traits the Pearl will have before it is produced and collected.",
    "mapGuide.step18.text": "Pearls can be used to boost your investment returns in the Bank, or they can simply be collected and traded.",
    "mapGuide.step19.text": "Clams can also boost your investment returns in the Bank. If you want to dive in to the details, you can find out more on our Medium page.",
    "mapGuide.step20.text": "I hope you enjoyed the tour! If you want to start exploring for yourself, I recommend that you start with the Bank and get some $GEM to spend at the Shop.",
    "mapGuide.step21.text": "If you get stuck or have any questions, try talking to Janet in the Visitor’s Infocenter. Have fun!",
    "Cool!": "Cool!",
    "Yes please!": "Yes please!",
    "Yes please": "Yes please",
    "No thank you": "No thank you",
    "Sure!": "Sure!",
    "Go to Infocenter": "Go to Infocenter",
    "Next": "Next",
    "Finish Tour": "Finish Tour",
    "G'day, welcome to Clam Island!": "G'day, welcome to Clam Island!",
    "If it's your first time here, I'd recommend you go to the Bank to get some $GEM, the local currency. You can then buy some Clams in the Shop with your $GEM, and produce Pearls using the Clams in the Farm.": "If it's your first time here, I'd recommend you go to the Bank to get some $GEM, the local currency. You can then buy some Clams in the Shop with your $GEM, and produce Pearls using the Clams in the Farm.",
    "We also have a Pearl Hunt Event on right now - if you produce the right type of Pearl, you could win a Tiffany & Co Necklace worth up to $10,000! Would you like to find out more about this event?": "We also have a Pearl Hunt Event on right now - if you produce the right type of Pearl, you could win a Tiffany & Co Necklace worth up to $10,000! Would you like to find out more about this event?",
    "Ok, no worries, I'll let you explore the island at your own leisure.": "Ok, no worries, I'll let you explore the island at your own leisure.",
    "Pretty cool, right? Did you want to go check out the Bank now, or do you want to keep looking around?": "Pretty cool, right? Did you want to go check out the Bank now, or do you want to keep looking around?",
    "Good to know!": "Good to know!",
    "No thanks": "No thanks",
    "Ok": "Ok",
    "Keep exploring": "Keep exploring",
    "Ok, let's go": "Ok, let's go",
    "infocenter.welcome.text": "Welcome to the Infocenter, traveller! You will find everything you need to know about Clam Island here.",
    "infocenter.guide.text": "Unfortunately we have only just opened so not everything is quite ready yet. For now, you can read our Visitor's Guide, watch a YouTube interview to get an overview of how Clam Island works. We promise we'll have much more content soon!",
    "Visitor's Guide": "Visitor's Guide",
    "YouTube Interview": "YouTube Interview",
    "skip.propose.text": "Would you like me to stop greeting you in the future unless you approach me first?",
    "skip.restore.text": "Would you like me to start approaching you to offer assistance again without prompting?",
    "skip.agree.text": "Ok, no problem, I will let you explore by yourself. If you change your mind, just come talk to me and click the \"Restore\" icon any time.",
    "skip.disagree.text": "Great! Always glad to be of assistance. Just talk to me if you need more help.",
    "No, I love talking to you!": "No, I love talking to you!",
    "OK": "OK",
    "saferoom.connect.text": "Excellent! First, let's get your wallet connected. You will need to do this in order to see your Clams. Press the \"Connect Wallet\" button in the top right of the screen.",
    "saferoom.connected.text": "Excellent, please follow the prompts above to purchase a Clam.",
    "saferoom.processing.text": "Hold on while we process your transaction...",
    "saferoom.congrats.text": "Thank you for your purchase! Let me just go fetch your Clam. I'll just be a minute.",
    "saferoom.collection.text": "You Clam is ready for collection!",
    "saferoom.collectionProcessing.text": "One moment, just let me just unbox this Clam for you. Did you know that no one knows what Clam is inside until you collect it, not even me?",
    "saferoom.congratsCollection.text": "Congratulations, here's your Clam! You may go to the Saferoom to see your Clam.",
    "saferoom.cancel.text": "Ok, let me know if you change your mind and want to buy some $CLAM.",
    "clam_shop.welcome.text": "Howdy friend. Welcome to my Clam Shop! Here you can buy Clams using $GEM and harvest them for $SHELL. Let's get into it then!",
    "clam_shop.intro.step1.text": "Alright, so first of all, $GEM is the native currency here at Clam Island, so you need to buy or earn some $GEM before you can buy Clams. You can do this at the Bank, if you haven't checked it out already.",
    "clam_shop.intro.step2.text": "Once you have enough $GEM, you can come and buy a Clam from me. My Clams are always available at market prices depending on demand.",
    "clam_shop.intro.step3.text": "My Clams are very unique! There are billions of possible trait combinations and 6 different rarity tiers. What you will get when you buy a Clam is completely random - not even I know what it will be!",
    "clam_shop.intro.step4.text": "The Clams that you buy can be deposited over at the Farm in order to produce Pearls. Pearls also have billions of possible trait combinations and are grouped into the same 6 rarity tiers.",
    "clam_shop.intro.step5.text": "Each Clam can only produce a limited number of Pearls in its lifespan, and producing the very last Pearl will kill the Clam. Don't worry, dead Clams are still yours and still can be traded! But they can't produce any more Pearls, and they can't be harvested for $SHELL.",
    "clam_shop.intro.step6.text": "$SHELL is the Clam Island governance token. $SHELL supply can only be increased by harvesting live Clams that are older than 48 hours. The harvesting process will destroy your Clam, so choose wisely!",
    "clam_shop.intro.step7.text": "The amount of $SHELL a Clam can be harvested for starts at 1, and increases by 0.1 for every new Pearl produced by the Clam that does not kill it.",
    "clam_shop.intro.step8.text": "However, Pearls produced by a Clam towards the end of its lifespan have a higher chance of being a rare one. So that last Pearl that will kill your Clam, also has the highest chance of being rare!",
    "clam_shop.intro.step9.text": "Now, to the really good part. I have a special arrangement with the Bank and the Farm, and that's what makes Clam Island so special. My Clams can earn you $GEM rewards in the Bank, and so can the Pearls that they produce!",
    "clam_shop.intro.step10.text": "The $GEM rewards depend on the traits of each Clam and Pearl, but on average they earn more $GEM than they cost. This means that by buying my Clams and farming Pearls, not only will you own unique Clams and Pearls on Clam Island, you could also actually profit!",
    "clam_shop.connect.text": "Oh I've noticed that you've not connected your blockchain wallet yet. Before you can buy or trade any Clams, you need to enable that...",
    "clam_shop.collect.text": "Looks like you still have a clam to collect from last time you visited. Please do so before you proceed.",
    "clam_shop.collection.text": "You Clam is ready for collection!",
    "clam_shop.collection_processing.text": "One moment, just let me unbox this Clam for you. Did you know that no one knows what Clam is inside until you collect it, not even me?",
    "clam_shop.collect_congrats.text": "Congrats on your Clam! You can take your time to savour your luck. We send your collected clams directly to the Saferoom, so you can see them there. Can I help you with anything else?",
    "clam_shop.processing.text": "Hold on while we process your transaction...",
    "clam_shop.congrats.text": "Thank you for your purchase! Let me just go fetch your Clam. I'll just be a minute.",
    "clam_shop.choose_path.text": "So, friend, how can I help you today?",
    "clam_shop.harvest_warn.text": "WARNING!! Harvesting a Clam will destroy it but you will get $SHELL in return. This process is not reversible. Do you want to continue?",
    "clam_shop.harvest_no_clams.text": "I'm sorry, you don't have any Clams that can be harvested right now. New Clams need to be incubated for {{incubationTime}} in the Saferoom before they can be harvested for $SHELL.",
    "clam_shop.harvest_choose_clams.text": "Please choose a Clam for harvesting.",
    "clam_shop.harvest_congrats.text": "Big Decision. We have added $SHELL to your wallet",
    "clam_shop.can_use_vested.text": "You have {{gem}} locked $GEM rewards, would you like to use these for buying your clam?",
    "Let's go!": "Let's go!",
    "farms.welcome.text": "Welcome to the Clam Farm! You can deposit your Clams here to produce Pearls, or check on the progress of Clams you have already deposited.",
    "farms.welcome_next.text": "It will just cost {{gem}} $GEM to produce a Pearl. Remember that each Clam can only produce a specific number of Pearls before it dies!",
    "farms.connect.text": "Excellent! First, let's get your wallet connected. You will need to do this in order to see your Clams. Press the \"Connect Wallet\" button in the top right of the screen.",
    "farms.withdraw.text": "This will stop the Pearl production process! But you can continue later without starting from scratch. Do you want to continue?",
    "farms.depositClamGemPrompt.text": "We require a deposit of ${gems} $GEM to produce the Pearl. The deposit will be consumed when a Pearl is produced. If you withdrew your Clam without producing a Pearl and without a refund of your deposit, then you won't need to pay the deposit again. Do you want to proceed?",
    "farms.depositClamGemDisagree.text": "OK. Let me know if you need anything.",
    "farms.depositClamError.text": "There was an error depositing clams. Error -> {{errorMsg}}",
    "farms.depositWithoutStaking.text": "Depositing a Clam without any deposits in native investment pools in the Bank will cause its GEM boost to be lost permanently. Are you sure you want to proceed?",
    "farms.depositClamSuccess.text": "Your clam has been deposited!. You can choose to deposit another clam.",
    "farms.pearlCollectGemprompt.text": "Remember When you deposited your clam here you added {{gems}} $GEM with it? So this $GEM will be spent now to collect the pearl. Do you want to proceed?",
    "farms.pearlCollectSuccess.text": "Your Pearl has been successfully collected! Would you like to see it now?",
    "farms.pearlSendSaferoom.text": "We will send your Pearl to the Saferoom. You can have your Clam back as well. Would you like to deposit it again to produce another Pearl?",
    "farms.pearlGenerateNew.text": "Great! you will just need to pay {{gems}} $GEM to produce another Pearl. Do you want to continue?",
    "farms.pearlSendClamSaferoom1.text": "Ok, your Clam will be returned to your Saferoom.",
    "farms.pearlSendClamSaferoom2.text": "No problem, we will send your Clam back to the Saferoom.",
    "farms.clamRarityAlreadyStaked.text": "You already have a Clam with the same rarity tier in the farm. Depositing this Clam will mean that you permanently lose the $GEM boost of {{gem}} associated with it. Are you sure you want to continue?",
    "farms.pearlNotEnoughGems.text": "Hold on, it looks like you don’t have enough $GEM. You can purchase some from the Bank, then you can come back and deposit your Clam.",
    "farms.pearl_processing.text": "Alrighty, give me a moment, this is a delicate operation...",
    "farms.pearl_collect_ready_prompt.text": "Aha, I can see a Pearl. Would you like to collect it?",
    "farms.pearl_collect_ready_prompt_cancel.text": "No worries, we will leave the Clam here for now, you can come back and collect it at any time. Please note that your Clam will not produce any more Pearls until you collect this one.",
    "farms.open_clam.text": "Alrighty, let me open this Clam up for you. One moment please.",
    "farms.error.text": "I'm sorry, something went wrong. Please try again.",
    "farms.refundDepositedGem.text": "Do you want to refund your deposited $GEM ?",
    "Withdraw Pearl": "Withdraw Pearl",
    "bank.connect.text": "Welcome to Clam Island Bank! You’ll need to connect your wallet using the button on the top right of your screen in order to invest with us.",
    "bank.connect_no_wallet.text": "Welcome to Clam Island Bank! It looks like you don’t have a blockchain wallet installed. You will need one in order to invest with us.",
    "bank.connect_wrong_chain.text": "Welcome to Clam Island Bank! In order to invest with us, you will need to switch your wallet to Binance Smart Chain.",
    "bank.welcome.text": "Welcome back to Clam Island Bank! Please let me know if you need help with anything.",
    "bank.welcome_back.text": "Hello again! Can I help you with anything?",
    "bank.acknowledge_no_help_needed.text": "No problem, happy investing! Just talk to me if you do need any help.",
    "bank.help_needed.text": "We are currently working on an explainer video, in the meantime please refer to our Visitor’s Guide. In the future the video will be part of the Visitor’s Information Centre.",
    "bank.process_transaction.text": "Please wait while we process your transaction. Please note, your wallet may ask you to approve two transactions one after the other - please approve both transactions if that occurs.",
    "bank.transaction_error.text": "We’re sorry, something went wrong and your transaction could not be processed. Funds have not been removed. Please try again later.",
    "bank.transaction_success.text": "Congratulations, your transaction was successful!",
    "bank.deposit_fee_alert.text": "Please note, this pool has a deposit fee, which is deducted on deposit and not refundable. Do you want to proceed?",
    "bank.withdraw_pearl_rewards_alert.text": "You still have pending Pearl reward boosts available. Withdrawing now will cause your boosted rewards to be reduced proportionally. Are you sure you want to withdraw?",
    "bank.pearl_boost_yield_alert.text": "This will destroy your Pearl in return for the investment boost, and is irreversible. Do you want to continue?",
    "bank.burn_pearl_confirmation.text": "This will forfeit your Pearl in return for a boost of {{gems}} $GEM streamed over 30 days. This is irreversible and you will not be able to get your Pearl back. Are you sure you want to continue?",
    "bank.burn_pearl_success.text": "All done! Your Pearl has been forfeited and your $GEM boost is now streaming.",
    "Yes": "Yes",
    "Dismiss": "Dismiss",
    "Yes, I understand": "Yes, I understand",
    "Buy Clams": "Buy Clams",
    "Tell me how": "Tell me how",
    "Back to Island": "Back to Island",
    "Withdraw": "Withdraw",
    "Go to Saferoom": "Go to Saferoom",
    "Find out more": "Find out more",
    "Got it, Boss": "Got it, Boss",
    "Connect": "Connect",
    "No. Buy Clams instead.": "No. Buy Clams instead.",
    "I want to buy Clams instead.": "I want to buy Clams instead.",
    "Go to Bank": "Go to Bank",
    "Sure": "Sure",
    "Show me!": "Show me!",
    "Refund": "Refund"
}
